tutorials/sedimentChannel/0/Mbed
FoamFile
{
    version 2.0;
    format ascii;
    class volScalarField;
    object Mbed;
}

dimensions [1 -2 0 0 0 0 0];
internalField uniform 0;
boundaryField
{
 upstream { type calculated; value uniform 0; }
 downstream { type calculated; value uniform 0; }
 bed { type fixedValue; value uniform 0.01; }
 lid { type calculated; value uniform 0; }
 sides { type empty; }
}
