tutorials/sedimentChannel/system/fvSchemes
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    object fvSchemes;
}

ddtSchemes { default Euler; }
gradSchemes { default Gauss linear; }
divSchemes
{
 default none;
 div(phi,U) Gauss linearUpwind grad(U);
 div(phiSed,C) Gauss upwind;
 div((nuEff*dev2(T(grad(U))))) Gauss linear;
 div(phi,k) Gauss upwind;
 div(phi,epsilon) Gauss upwind;
 div(phi,omega) Gauss upwind;
 div(phi,nuTilda) Gauss upwind;
}
laplacianSchemes { default Gauss linear corrected; }
interpolationSchemes { default linear; }
snGradSchemes { default corrected; }
wallDist { method meshWave; }
fluxRequired { default no; p; C; }
