tutorials/sedimentChannel/system/fvSolution
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    object fvSolution;
}

solvers
{
 p { solver PCG; preconditioner DIC; tolerance 1e-10; relTol 0; }
 pFinal { $p; }
 "(U|C|k|epsilon|omega|nuTilda)" { solver smoothSolver; smoother symGaussSeidel; tolerance 1e-12; relTol 0; }
 "(U|C|k|epsilon|omega|nuTilda)Final" { $U; }
}
PIMPLE { nOuterCorrectors 2; nCorrectors 2; nNonOrthogonalCorrectors 0; momentumPredictor yes; }
relaxationFactors { equations { U 1; } }
